Revit 2020 API
ImageType.IsViewImage Property
 The ImageType was created via "Save to Project as Image" function. For such ImageTypes the file path is an empty string.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Since: 2020
Syntax
C#
public bool IsViewImage { get; }
Visual Basic
Public ReadOnly Property IsViewImage As Boolean
	Get
Visual C++
public:
property bool IsViewImage {
	bool get ();
}
See Also
ImageType Class
Autodesk.Revit.DB Namespace